Repository: keeki-fami/Ebbinghaus
Catalog: Ebbinghaus/Strings/Localizable.xcstrings
Source language: en
Languages: ja

# addProblem.added.description
source: Your own problem set has been created.
ja: あなただけの問題セットが作られました

# addProblem.step1
source: Step 1/2
ja: ステップ1/2

# addProblem.step1.creatingProblem.description
source: Create a problem.
ja: 問題の作成をしてください

# addProblem.step1.creatingProblem.keyword.description
source: Enter the words to include in your answer.
ja: 解答に含める単語を入力してください

# addProblem.step1.creatingProblem.textField1
source: Enter the question.
ja: 問題の内容を入力してください。

# addProblem.step1.creatingProblem.textField2
source: Enter an example answer.
ja: 解答例を入力してください。

# addProblem.step1.creatingProblem.title1
source: Question
ja: 問題

# addProblem.step1.creatingProblem.title2
source: Answer
ja: 解答

# addProblem.step1.creatingProblem.toggle
source: Use keywords to determine the correct answer.
ja: 正解判定に、キーワードを使用する。

# addProblem.step1.creatingProblem.toggle.description
source: When the button above is OFF, only an answer that exactly matches the answer is considered correct. When the button is ON, the answer is considered correct if it contains all of the specified keywords.
ja: 上のボタンがOFFの場合は、答えと同じ回答のみ正解にします。上のボタンがONの場合は、解答に、指定したキーワードがすべて含まれていた場合に正解にします。

# addProblem.step1.error.description
source: Please fill in all the questions and answers.
ja: 問題, 解答を全て埋めてください。

# addProblem.step1.error.descriptionSetEmpty
source: Please add at least one question.
ja: 問題は一つ以上追加してください。

# addProblem.step1.error.title
source: Error
ja: エラー

# addProblem.step2
source: Step 2/2
ja: ステップ2/2

# addProblem.step2.description
source: Enter the name of the problem set.
ja: 問題集の名前を入力してください

# alert.notUpdate
source: The phase will not be updated this time.
ja: 今回はphaseが更新されません

# button.add
source: Add
ja: 追加

# button.cancel
source: Cancel
ja: キャンセル

# button.delete
source: Delete
ja: 削除

# button.determine
source: Done
ja: 決定

# button.next
source: Next
ja: 次に進む

# button.solve
source: Answer
ja: 解答

# button.toHome
source: Back to Home
ja: ホームに戻る

# card.timeFormat
source: %1$lld day %2$lld hours
ja: %1$lld日 %2$lld時間後

# home.others.card.beforeNotify.text
source: These are problems that are recommended for review starting today.
ja: 今日以降、復習すると良い問題です。

# home.others.card.beforeNotify.title
source: Problems Due Soon
ja: 通知前の問題

# home.others.card.expired.text
source: These problems are past their review date. Let's review them now!
ja: 期限が過ぎた問題です。すぐに復習しましょう！

# home.others.card.expired.title
source: Overdue Problems
ja: 期限後の問題

# home.others.title1
source: Others
ja: その他

# home.todayproblem.addDescription1
source: 1. Add a problem using the “+” button in the bottom-right corner!
ja: 1. 画面右下の「+」ボタンから、問題を追加しよう！

# home.todayProblem.addDescription2
source: 2. Solve the problems shown in “Today’s Problems”!
ja: 2. 「今日の問題集」に表示される問題を解こう！

# home.todayProblem.completeText
source: Great! Following EbbingHaus's forgetting curve, your learning is steadily paying off.
ja: 素晴らしい！ Ebbinghausの忘却曲線に沿って あなたの学習は着実に成果になっています。

# home.todayProblem.title1
source: Today’s Problems
ja: 今日の問題集

# others.beforeNotify.text
source: These problem sets are recommended for review starting tomorrow.
ja: 明日以降に復習すると良い問題集です。

# others.beforeNotify.title
source: Problems Due Soon
ja: 期限前の問題

# others.expired.text
source: You missed a good opportunity to review these problem sets, but it's not too late!
ja: 良い復習の機会を逃してしまった問題集です。まだ間に合います！

# others.expired.title
source: Overdue Problems
ja: 期限切れの問題

# others.nothing
source: No problem sets.
ja: 問題集はありません。

# result.button.x
source: Share your learning streak on X
ja: Xで継続記録をシェア

# result.feedback.text
source: feedback
ja: フィードバック

# result.feedback1.text1
source: Perseverance is power.
ja: 継続は力なり

# result.feedback1.title
source: Review #%d
ja: %d回目の復習

# result.feedback2.correctText
source: Correct Answers
ja: 正解した問題数

# result.feedback2.incorrectText
source: Incorrect Answers
ja: 間違えた問題数

# result.feedback2.title1
source: Accuracy
ja: 正答率

# result.feedback3.correctAnswer
source: Correct Answer
ja: 正答

# result.feedback3.problem
source: Question
ja: 問題

# result.feedback3.text
source: This is currently the problem you have answered incorrectly the most times. Let's get it right next time!
ja: 現在、間違えた回数が最も多い問題です。次は正解しましょう！

# result.feedback3.title
source: Incorrect Problem
ja: 間違えた問題

# result.feedback3.yourAnswer
source: Your Answer
ja: あなたの解答

# result.feedback4.text
source: Keep up the good work!
ja: 次も頑張りましょう！

# result.feedback4.title
source: Next Review
ja: 次回の復習

# result.great
source: Great!
ja: 素晴らしい！

# result.noMiss
source: No mistakes!
ja: 間違えた問題はありませんでした！

# result.text
source: Good Job!
ja: お疲れ様でした

# result.xPost
source: 🎉 Review #%lld complete! I reviewed "%@". Keep reviewing along the forgetting curve with "EbbingHaus"! 🧠 #EbbingHaus #ForgettingCurve #SpacedRepetition
ja: 🎉 %lld回目の復習完了！ 「%@」の復習をしました。 「EbbingHaus」を使って、忘却曲線に沿った復習をしよう！🧠 #EbbingHaus #忘却曲線 #復習 #記憶術

# solving.answerLabel
source: Answer
ja: 答え

# solving.correct
source: 🥳Correct!
ja: 🥳正解！

# solving.incorrect
source: 😱Incorrect...
ja: 😱不正解...

# solving.keywordCheck
source: Keyword Check
ja: キーワードチェック

# solving.oneOnOne
source: Question and Answer
ja: 一問一答

# solving.textField
source: Enter your answer
ja: 解答を入力
